In [2]:

!pip install pandas
import pandas as pd

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-2.3.3-cp314-cp314-macosx_11_0_arm64.whl.metadata (91 kB)
Requirement already satisfied: numpy>=1.26.0 in /Users/erikahartai/Library/Python/3.14/lib/python/site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/erikahartai/Library/Python/3.14/lib/python/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: tzdata>=2022.7 in /Users/erikahartai/Library/Python/3.14/lib/python/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /Users/erikahartai/Library/Python/3.14/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp314-cp314-macosx_11_0_arm64.whl (10.8 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.8/10.8 MB 14.3 MB/s  0:00:00.1 MB/s eta 0:00:01:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Installing collected packages: pytz, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2/2 [pandas]━━━━ 1/2 [pandas]
Successfully installed pandas-2.3.3 pytz-2025.2

In [3]:
df2 = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill')
                 )
df2

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

In [4]:
df2['Day'] = "Monday" # Como un diccionario
df2

             name        type  AvgBill     Day
0  Foreign Cinema  Restaurant    289.0  Monday
1       Liho Liho  Restaurant    224.0  Monday
2        500 Club         bar     80.5  Monday
3      The Square         bar     25.3  Monday

In [5]:

#Vamos a usar el método insert
df2.insert(loc=1, column="Stars", value=[2,2,3,4])
df2

             name  Stars        type  AvgBill     Day
0  Foreign Cinema      2  Restaurant    289.0  Monday
1       Liho Liho      2  Restaurant    224.0  Monday
2        500 Club      3         bar     80.5  Monday
3      The Square      4         bar     25.3  Monday

In [7]:
df2["AvgBillIVA"] = df2["AvgBill"]*1.21
df2

             name  Stars        type  AvgBill     Day  AvgBillIVA
0  Foreign Cinema      2  Restaurant    289.0  Monday     349.690
1       Liho Liho      2  Restaurant    224.0  Monday     271.040
2        500 Club      3         bar     80.5  Monday      97.405
3      The Square      4         bar     25.3  Monday      30.613

In [10]:
df3 = df2.assign(AvgHalfBill=df2.AvgBill / 2, Michelin_Star=3)
df3

df3["HOLA"] = df3.name.str.capitalize()
df3

,name,Stars,type,AvgBill,Day,AvgBillIVA,AvgHalfBill,Michelin_Star,HOLA
0,Foreign Cinema,2,Restaurant,289.0,Monday,349.690,144.50,3,Foreign cinema
1,Liho Liho,2,Restaurant,224.0,Monday,271.040,112.00,3,Liho liho
2,500 Club,3,bar,80.5,Monday,97.405,40.25,3,500 club
3,The Square,4,bar,25.3,Monday,30.613,12.65,3,The square